Repository: GVoreste/analysis_finance_reports
Catalog: docs/source/locales/*/LC_MESSAGES/dev/code.po
Languages: it

source: Code development
it: Sviluppo del codice

source: The focus of this guide is the development of the code related specific to the parsing of a `pdf format`. With `pdf format` we identify the series of operations and the code necessary to parse to `csv` a series of financial reports.
it: Il focus di questa guida è lo sviluppo del codice relativo alla elaborazione specifica di un `formato pdf`. Con `formato pdf`, identifichiamo una serie di operazioni e di codice necessario per elaborare una serie di report finanziari in `csv`.

source: We decided to implement a structure flexible enough to be able to parse different reports, but making some hypotesys in order to semplify and standardize the parsing process. The aim is to make to not repeat all the code common to all the format so that the contributions can focus on enlarge the database of the supported pdf.
it: Abbiamo deciso di implementare la struttura in modo sufficientemente flessibile da elaborare report diversi, ma facendo alcune ipotesi in maniera da semplificare e standardizzare il processo di parsing. L'obbiettivo è quello di non ripetere il codice comune a tutti i formati in modo che le contribuzioni si possono concentrare sull'integrazione di nuovi pdf supportati.

source: The general schema for parsing a pdf can be rappresented with the following:
it: Lo schema generale per l'elaborazione di un pdf può essere rappresentato con l'immagine seguente:

source: The document is firstly divided in different pages and converted in a ``xml`` string using the `PyMuPDF <https://pypi.org/project/PyMuPDF/>`_ package. The assumption is that each page of the document contain the necessary information to get the context and to understand the meaning of the data relevant to construct the final `csv file`. This assumption seems quite resrtictive, but it is very essential in order to simplify and design reasonably fast pasrsing algorithms. This assumption makes possible to implement data level parallelism on the pdf pages; now the current implementation run on different batch of pages in parallel spawning different processes (when in :ref:`BATCH MODE <batch_mode>` the parallelism is done at document level and the different pages are processed sequentially). The idea behind the assumption is that a well designed pdf page should contain all the necessary information for a human being to understand the context. If this assumption will show to be too resrtictive we could not assume that the context of the page would be the previous pages, but we would be forced to parse the document subsequent times in order to get the relevant context.
it: Il documento è prima diviso in pagine e convertito in una stringa ``xml`` usando il pacchetto `PyMuPDF <https://pypi.org/project/PyMuPDF/>`_ . L'assunzione è che ogni pagina del documento contenga l'informazione necessaria per delineare il contesto e capire il significato dei singoli dati rilevanti nel `file csv` finale. Questa assunzione può sembrare abbastanza restrittiva, ma risulta essenziale per semplificare e realizzare algoritmi ragionevolmente rapidi nell'elaborazione. Questa assunzione rende possibile implementare un parallelismo a livello di dati sulle pagine pdf; attualmente l'implementazione esegue su diversi batch di pagine in parallelo creando processi diversi (quando si è in :ref:`MODALITA' BATCH <batch_mode>` il parallelismo è fatto a livello di documento e le diverse pagine sono processate sequenzialmente). L'idea dietro questa assunzione è che una pagina pdf ben ideata dovrebbe contenere tutte le informazioni necessarie ad un essere umano per capire il contesto. Se questa assunzione dovesse dimostrarsi troppo restrittiva, non potremmo assumere che il contesto delle pagine debba necessariamente essere le pagine precedenti, ma saremmo costretti a analizzare il documento diverse volte così da estrarre il contesto rilevante.

source: Sometimes the information doesn't seems to be self contained but this dependence is only a one to one, one to many or many to many relation between the different objects. An example of this can be the case of the parsing of a pdf document containing some data related to some customers and in other pages, about orders and products. In this example it seems that the `Customer`, the `Product` and the `Order` records are interdependent, but depending of the report design the algorithm can parse the self contained information of `Customers`, `Products` and `Orders` and just right before the csv output relate the different record with an ``id`` field (for uderstanding better the proposed approach for how to treat these kind of cases think at the concept of `foreign key <https://en.wikipedia.org/wiki/Foreign_key>`_ in the database realm). The mechanism for supporting this degree of interdependance it is by the use of ``Promises`` and the output of ``PromisesResolutionContexs``. The assumption breaks in the presence of a true dependence of the information.
it: Alcune volte l'informazione non sembra essere autonoma ma la sua dipendenza è in realtà una semplice relazione uno ad uno, uno a molti o molti a molti tra oggetti diversi. Un esempio di questo può essere il caso dell'analisi di un documento PDF contenente alcuni dati relativi a clienti e, in altre pagine, informazioni su ordini e prodotti. In questo esempio sembra che i record `Cliente`, `Prodotto` e `Ordine` siano interdipendenti, ma a seconda della struttura del report, l'algoritmo può analizzare le informazioni autonome di `Clienti`, `Prodotti` e `Ordini` e solo poco prima dell'output in CSV collegare i diversi record tramite un campo ``id`` (per comprendere meglio l'approccio proposto per gestire questi casi, si pensi al concetto di `chiave esterna <https://it.wikipedia.org/wiki/Chiave_esterna>`_ nel contesto dei database). Il meccanismo per supportare questo grado di interdipendenza avviene attraverso l'uso di ``Promises`` (promesse) e l'output di ``PromisesResolutionContexs`` (contesti per la risoluzione delle promesse). L'assunzione viene meno in presenza di una vera dipendenza delle informazioni.

source: The developer that wants to add a series of reports to the supported ones, has to provide the specific implementation of the ``PdfFilter``, ``TextExtract`` and ``Deserialize`` functions (with them of the ``PdfBlock`` and ``TextBlock`` classes). Each ``xml`` page will be parsed by a ``PdfFilter`` function that will output a list of relevant ``PdfBlocks``. The content of these blocks is related and parsed by a function called ``TextExtract`` and output a list of blocks that have a one to one relation with the information that will populate a csv row called ``TextBlock``. Each block is parsed independently into an object (an abstract ``FinancialData``) that as to be one between the one reconnaissed by the system (for now ``Equity`` and ``Bond``) or a ``PromisesResolutionContext``. The ``FinancialData`` can contain the actual data or deferred values called in this context 'promises' of value. In the most common case the financial data contain all the relevant data and is serialized in a python dict in a predefined way and output to a the resulting csv file.
it: Lo sviluppatore che desidera aggiungere una serie di report a quelli supportati, deve fornire l'implementazione specifica delle funzioni ``PdfFilter``, ``TextExtract`` e ``Deserialize`` (insieme alle classi ``PdfBlock`` e ``TextBlock``). Ogni pagina ``xml`` verrà analizzata da una funzione ``PdfFilter`` che produrrà una lista di ``PdfBlocks`` rilevanti. Il contenuto di questi blocchi viene elaborato da una funzione chiamata ``TextExtract`` che restituisce una lista di blocchi con una relazione uno a uno con le informazioni che popoleranno una riga del csv, chiamati ``TextBlock``. Ogni blocco viene analizzato indipendentemente in un oggetto (un ``FinancialData`` astratto) che deve essere uno di quelli riconosciuti dal sistema (attualmente ``Equity`` e ``Bond``) o un ``PromisesResolutionContext``. Il ``FinancialData`` può contenere dati effettivi o valori differiti chiamati in questo contesto 'promesse' di valore. Nel caso più comune i dati finanziari contengono tutte le informazioni rilevanti e vengono serializzati in un dizionario Python in modo predefinito e scritti nel file csv risultante.

source: The aim of this function is to filter from the ``xml`` rappresentation of the pdf page the relevant information using the layout or the typografic signature of them. A constraint that we choose to try to respect is to use only information related to the grafical appearance of the pdf without looking at the textual content and parse it semantically or evaluating the meaning. This constraint is important to divide the complexity of parsing a pdf in more straight forward and standardized steps. The typical ``PdfFilter`` function will look at the font, the position of the different parts of the pdf and eventually part of the text that is fixed and is considered part of the page layout (for example a header present in all pages), from this will compute some bit of information and add converge to some ``PdfBlocks`` with their custom metadata.
it: Lo scopo di questa funzione è filtrare dalla rappresentazione ``xml`` della pagina pdf le informazioni rilevanti utilizzando il layout o la firma tipografica. Un vincolo che abbiamo scelto di rispettare è utilizzare solo informazioni relative all'aspetto grafico del pdf senza analizzare semanticamente il contenuto testuale o valutarne il significato. Questo vincolo è importante per suddividere la complessità dell'analisi di un pdf in passi più semplici e standardizzati. La tipica funzione ``PdfFilter`` esaminerà il font, la posizione delle diverse parti del pdf ed eventualmente parti di testo fisse considerate parte del layout della pagina (ad esempio un'intestazione presente in tutte le pagine), da cui ricaverà alcune informazioni e le converrà in ``PdfBlocks`` con i relativi metadati personalizzati.

source: The aim of this function is to extract from the ``PdfBlocks`` the relevant blocks of text and add semantic information. In particular this function is the one that takes in input the list of the target companies and that look at the content of the variable text present in the ``PdfBlocks``. The typical ``TextExtract`` function will use `regular expressions <https://en.wikipedia.org/wiki/Regular_expression>`_ to understand the role of each part of test and to extract the relevant information of the financial data related with the companies of interest.
it: Lo scopo di questa funzione è estrarre dai ``PdfBlocks`` i blocchi di testo rilevanti e aggiungere informazioni semantiche. In particolare, questa funzione riceve in input la lista delle aziende target e analizza il contenuto del testo variabile presente nei ``PdfBlocks``. La tipica funzione ``TextExtract`` utilizzerà `regular expressions <https://it.wikipedia.org/wiki/Espressione_regolare>`_ per comprendere il ruolo di ogni parte del testo ed estrarre le informazioni rilevanti dai dati finanziari relativi alle aziende di interesse.

source: The aim of this function is to transform the parsed information into a python object with some standard fields and validate them. This function will cast the data into the python types that more reflect the nature of the data. In this steps no filtering is done, each ``TextBlock`` will correspond to a python object. This constraint impose the focus of this function to the cast operation of the different field. The abstract class that this function output is called ``FinancialData``. Each class field is read only and consists in some core information and some additional infos. The concrete classes that inherit from ``FinancialData`` for now are the ``Equity`` and ``Bond`` classes (the bond class has the interest rate and the maturity date as additional infos). This objects are then casted in a predefined way in a python dict and then with `Pandas <https://en.wikipedia.org/wiki/Pandas_(software)>`_ on a dataframe dumped directly in a `csv file`. The ``FinancialData`` usually contain all the concrete values but sometimes can happen that some fields are resolvables only after complete parsing; for cases like that refear to the :ref:`Promises section <promises>`
it: Lo scopo di questa funzione è trasformare le informazioni analizzate in un oggetto Python con campi standardizzati e validarli. Questa funzione convertirà i dati nei tipi Python che meglio riflettono la loro natura. In questa fase non viene fatto alcun filtraggio, ogni ``TextBlock`` corrisponderà a un oggetto Python. Questo vincolo focalizza la funzione sulle operazioni di conversione dei diversi campi. La classe astratta prodotta da questa funzione si chiama ``FinancialData``. Ogni campo della classe è di sola lettura e consiste in alcune informazioni principali e alcune aggiuntive. Le classi concrete che ereditano da ``FinancialData`` sono attualmente ``Equity`` e ``Bond`` (la classe bond ha il tasso di interesse e la data di scadenza come informazioni aggiuntive). Questi oggetti vengono poi convertiti in modo predefinito in un dizionario Python e quindi, con `Pandas <https://it.wikipedia.org/wiki/Pandas_(software)>`_, in un dataframe scritto direttamente in un `file csv`. Il ``FinancialData`` solitamente contiene tutti i valori concreti, ma a volte può accadere che alcuni campi siano risolvibili solo dopo l'analisi completa; per questi casi si rimanda alla sezione :ref:`Promises <promises>`

source: ``PdfBlock`` and ``TextBlock``
it: ``PdfBlock`` e ``TextBlock``

source: These block consists of three part:
it: Questi blocchi consistono in tre parti:

source: A ``BlockType`` (``PdfBlockType`` and ``TextBlockType``), that is a required label that identify the grafical and the semantic role of the information bit. These two fieds are implemented as enums and the possible values has to be chosen by the format developer (it is part of the format specification)
it: Un ``BlockType`` (``PdfBlockType`` e ``TextBlockType``), ovvero un'etichetta obbligatoria che identifica il ruolo grafico e semantico dell'informazione. Questi due campi sono implementati come enumerazioni (enum) e i valori possibili devono essere definiti dallo sviluppatore del formato (fa parte delle specifiche del formato).

source: A ``metadata`` field, that should contain custom data related to graphical and semantic information. The ``BlockType`` should be related to the expected keys in the metadata field. The implementation is a free and optional python dict
it: Un campo ``metadata``, che dovrebbe contenere dati personalizzati relativi a informazioni grafiche e semantiche. Il ``BlockType`` dovrebbe correlarsi con le chiavi attese nel campo metadata. L'implementazione è un dizionario Python libero e opzionale.

source: An optional ``content`` field, that should contain the textual information in the pdf related to the block
it: Un campo opzionale ``content``, che dovrebbe contenere le informazioni testuali nel pdf relative al blocco.

source: in addition to these fields, the ``TextBlock`` has a ``PdfBlock`` related to him from which is is taken from (if it is computed from more, the most important).
it: Oltre a questi campi, il ``TextBlock`` ha un ``PdfBlock`` associato da cui è estratto (se derivato da più blocchi, viene considerato quello più importante).

source: ``Promise``
it: ``Promise`` (promessa)

source: This class is a generic class that exists in more concrete forms like ``SubfundPromise`` or ``CurrencyPromise`` and it represent a placeholder to an information that can be resolved only after the pdf is completely parsed. When a ``FinancialData`` is istantiated the developer can `'promise'` that the data will be provided putting a promise as a value. The promise is caraterized by an ``id`` field that identify it in order to resolved to a specific value after the parsing. The value will be resolved using a ``PromisesResolutionMap`` that link ``id`` to values or to other ``Promises`` in a chain that has to close with a concrete value. In this way right before generating the ``csv`` the sobstitution are made and the actual field are computed using the map. This map is built merging all the ``PromisesResolutionContexts`` in output of the ``deserialize`` function. The ``PromisesResolutionContexs`` should be something in the form of a python dict with a key (that will be matched on the ``Promises`` ids) and a value (concrete or itself a ``Promise``).
it: Questa classe è una classe generica che esiste in forme più concrete come ``SubfundPromise`` o ``CurrencyPromise`` e rappresenta un segnaposto per un'informazione risolvibile solo dopo l'analisi completa del pdf. Quando un ``FinancialData`` viene istanziato, lo sviluppatore può *promettere* ("promise") che il dato sarà fornito inserendo una promise come valore. La promise è caratterizzata da un campo ``id`` che la identifica per la risoluzione a un valore specifico post-analisi. Il valore verrà risolto usando una ``PromisesResolutionMap`` che collega gli ``id`` a valori o ad altre ``Promises`` in una catena che deve chiudersi con un valore concreto. In questo modo, appena prima della generazione del ``csv``, avvengono le sostituzioni e i campi effettivi vengono calcolati usando la mappa. Questa mappa è costruita unendo tutti i ``PromisesResolutionContexts`` in output dalla funzione ``deserialize``. I ``PromisesResolutionContexts`` devono essere dizionari Python con una chiave (da abbinare agli ``id`` delle ``Promises``) e un valore (concreto o a sua volta una ``Promise``).

source: The ``id`` is expected to be provided one and only one time in the whole parsing process. If the same id is provided in two different ``PromisesResolutionContexs`` the value is overwritten in a unpredictable way.
it: L'``id`` deve essere fornito una sola volta nell'intero processo di analisi. Se lo stesso ``id`` appare in due diversi ``PromisesResolutionContexts``, il valore viene sovrascritto in modo non prevedibile.

source: In practice
it: Nel pratico

source: If you want to create the support for a new format you should choose a name and create a directory with same name into ``src/freeports_analysis/formats``. In this directory you can put the number of files and subdirectory that you want, the only constraint is that when imported as a submodule, the package expect to find the three function ``PdfFilter``, ``TextExtract``, ``Deserialize`` with their respective signatures and the definition of the two enums ``PdfBlockType`` and ``TextBlockType``. You can take as reference the format called ``_default`` as a template. For helping the support for new formats we provide a series of utilities into the submodule ``src/freeports_analysis/formats_utils``. These utilities divide in four different kind of helpers:
it: Per aggiungere il supporto a un nuovo formato, scegliere un nome e creare una directory con lo stesso nome in ``src/freeports_analysis/formats``. In questa directory è possibile inserire qualsiasi numero di file e sottodirectory, con l'unico vincolo che, quando importata come submodulo, il pacchetto si aspetta di trovare le tre funzioni ``PdfFilter``, ``TextExtract``, ``Deserialize`` con le rispettive firme, e la definizione dei due enum ``PdfBlockType`` e ``TextBlockType``. Come riferimento, è possibile usare il formato ``_default`` come template. Per facilitare l'aggiunta di nuovi formati, forniamo una serie di utility nel submodulo ``src/freeports_analysis/formats_utils``, suddivise in quattro categorie:

source: useful function to create the parsing algorithm
it: funzioni utili per creare l'algoritmo di elaborazione

source: decorators for adding standard functionalities to the parsing functions
it: decoratori per aggiungere funzionalità standard alle funzioni di parsing

source: decorators that provide a standard implementation of ``PdfFilter``, ``TextExtract`` and ``Deserialize``
it: decoratori che forniscono implementazioni standard di ``PdfFilter``, ``TextExtract`` e ``Deserialize``

source: enums containing common ``PdfBlockType`` and ``TextBlockType`` implementations
it: enum contenenti implementazioni comuni di ``PdfBlockType`` e ``TextBlockType``

source: the aim is to see the repeatitive parsing patterns and create some routines and implementation that can be parametrized and reused. To activate the support for a certain format, his name in capslock has to be added to the ``src/freeports_analysis/data/format_url_mapping.yaml`` file; this file is composed with some format names (this name lowered will be the same of the module loaded to parse the pdf) and a list of regular expressions used against url provided (``URL``) as a program argument to infer the correct format to use upon remote resource parsing.
it: L'obiettivo è identificare pattern di parsing ripetitivi e creare routine parametrizzabili e riutilizzabili. Per attivare il supporto a un formato, il suo nome in MAIUSCOLO va aggiunto al file ``src/freeports_analysis/data/format_url_mapping.yaml``; questo file contiene nomi di formati (il nome in minuscolo corrisponderà al modulo caricato per l'analisi) e una lista di espressioni regolari applicate agli URL forniti (``URL``) come argomento del programma, per inferire il formato corretto durante l'analisi di risorse remote.

source: the order of the regular expressions and of the formats matters, because the inferred one is the first match of this list.
it: l'ordine delle espressioni regolari e dei formati è rilevante, perché quello inferitoè il primo che concorde con quelli nella lista

source: Last but not least there is a directory in the repository called ``devtools/`` whit a template `Jupyter Notebook <https://jupyter.org/>`_ and some utilities for examining the pdf, developing the format specification and tests. This directory is intended as the directory where to design and experiment with the different component before integrating in the package. In order to use the notebook, copy the template and rename it as you want (deleting the ``.template.`` part).
it: Infine, nel repository è presente una directory ``devtools/`` con un template di `Jupyter Notebook <https://jupyter.org/>`_ e utility per esaminare pdf, sviluppare specifiche di formato e test. Questa directory è pensata per progettare e sperimentare componenti prima dell'integrazione nel pacchetto. Per usare il notebook, copiare il template e rinominarlo (rimuovendo la parte ``.template.``).
