Repository: GVoreste/analysis_finance_reports
Catalog: docs/source/locales/*/LC_MESSAGES/dev/i18n.po
Languages: it

source: Interazionalization *(i18n)*
it: Internazionalizzazione *(i18n)*

source: This guide focus on the translation process of the documentation and of the source code. The system and the conventions used by both documentation and source code internationalization are the one used by the `GNU gettext <https://en.wikipedia.org/wiki/Gettext>`_ system. In particular on the root of the repository is present a file called ``freeports.pot`` with the updated list of the strings present in the source code, and under ``docs/build/gettext`` the files with the templates of documentation translatable content. Translators will mostly work with ``.po`` files ready to be translated. In a second time this files are compiled in a machine readable format with exstension ``.mo``. So the ``.mo`` files are the one the actively contain the translation, but they are generated from the ``.po`` files.
it: Questa guida si concentra sul processo di traduzione della documentazione e del codice sorgente. Il sistema e le convenzioni utilizzate sia dalla internazionalizzazione della documentazione che da quella del codice sorgente, sono quelle usate dal sistema `GNU gettext <https://en.wikipedia.org/wiki/Gettext>`_. In particolare alla base del repositorio è presente un file chiamato ``freeports.pot`` con la lista aggiornata delle frasi presenti nel codice sorgente, e sotto ``docs/build/gettext`` i file con i template del contenuto traducibile della documentazione. I traduttori dovranno lavorare per la maggior parte del tempo con i file ``.po`` pronti per accogliere le traduzioni. In un secondo momento questi file sono compilati in un formato leggibile dal computer con le estensione ``.mo``. Quindi i file ``.mo`` sono quelli che contengono attivamente la traduzione, ma essi sono generati a partire dai file ``.po``.

source: Translation of the code
it: Traduzione del codice

source: You can find a folder into ``src/freeports_analysis/locales`` whit different language folders. The id is the `ISO 639 <https://en.wikipedia.org/wiki/ISO_639>`_ code of the language. In the folder of the language that you want to translate there should be a directory called ``LC_MESSAGES`` and a file called ``messages.po``. This file contains all the text strings present in the source code. You can translate the strings using a text editor or using a specific program to translate ``.po`` files like for example `Poedit <https://poedit.net/>`_.
it: Puoi trovare una cartella in ``src/freeports_analysis/locales`` con diverse sottocartelle della lingua. L'identificativo è il codice `ISO 639 <https://en.wikipedia.org/wiki/ISO_639>`_ della lingua. Nella cartella di un determinato idioma di cui vuoi contribuire alla traduzione, dovrebbe essere presente una cartella chiamata ``LC_MESSAGES`` e un file con nome ``messages.po``. Questo file contiene tutte le stringhe di testo presente nel codice sorgente. Puoi tradurre queste frasi utilizzando un editor di testo o un programma specifico per tradurre file ``.po`` come per esempio `Poedit <https://poedit.net/>`_.

source: Translation of the documentation
it: Traduzione della documentazione

source: You can find a folder into ``docs/source/locales`` whit different language folders. The id identifyng the lang is the `ISO 639 <https://en.wikipedia.org/wiki/ISO_639>`_ code of the language. In the folder of the language that you want to translate there should be a directory called ``LC_MESSAGES`` and a some ``.po`` files. This files contain all the text strings present in the source code. You can translate the strings using a text editor or using a specific program to translate ``.po`` files like for example `Poedit <https://poedit.net/>`_.
it: Puoi trovare una cartella in ``docs/source/locales`` con diverse sottocartelle della lingua. L'identificativo è il codice `ISO 639 <https://en.wikipedia.org/wiki/ISO_639>`_ della lingua. Nella cartella di un determinato idioma di cui vuoi contribuire alla traduzione, dovrebbe essere presente una cartella chiamata ``LC_MESSAGES`` e alcuni file ``.po``. Questi file contengono tutte le stringhe di testo presente nel codice sorgente. Puoi tradurre queste frasi utilizzando un editor di testo o un programma specifico per tradurre file ``.po`` come per esempio `Poedit <https://poedit.net/>`_.

source: Building the translations
it: Compilazione delle traduzioni

source: For updating the translations the deploy mechanism is similar in the case of source code and documentation and is caraterized by three steps:
it: Per aggiornare le traduzioni il meccanismo di integrazione nel caso del codice sorgente e della documentazione, è simile e caratterizzato da tre fasi:

source: generate the ``.pot`` file(s) using the source code or the modified documentation
it: generazione del/i file ``.pot`` usando il codice sorgente o la documentazione modificata

source: updating the ``.po`` files using the new ``.pot`` file(s)
it: aggiornamento dei file ``.po`` usando il/i nuovo/i file ``.pot``

source: compile ``.po`` files in ``.mo`` files
it: compilazione dei file ``.po`` in file ``.mo``

source: In the case of the source code the command to launch are:
it: Nel caso del codice sorgente i comandi da lanciare sono:

source: In the case of the documentation are (from inside the ``docs/`` directory):
it: Nel caso della documentazione sono (da dentro la cartella ``docs/``):
