Repository: GVoreste/analysis_finance_reports
Catalog: docs/source/locales/*/LC_MESSAGES/dev/index.po
Languages: it

source: Contents:
it: Contenuto:

source: Developer documentation
it: Documentazione per sviluppatori

source: The project consists in different repositories, specifically this section focus on the repository containing the source code and the documentation.
it: Il progetto consiste in diversi repositori, nello specifico questa sezione si concentra sul repositorio contenente il codice sorgente e la documentazione.

source: This repository has two protected branches ``main`` and ``dev``, plus any other additional non protected branches. The logic is that ``dev`` branch is used for the active development, ``main`` for the deployment. On both branches each commit triggers a `CI <https://en.wikipedia.org/wiki/Continuous_integration>`_ pipeline on the `Freeport Jenkins server <https://jenkins.freeports.org>`_ this server do some checks on the code (specified in the ``Jenkinsfile`` on top of the repository). Specifically it:
it: Questo repositorio ha due rami protetti ``main`` e ``dev``, più eventuali altri rami non protetti. La logica è che il ramo ``dev`` sia usato per lo sviluppo attivo, ``main`` per la distribuzione. Su tutti e due i rami ogni commit innesca una `CI <https://en.wikipedia.org/wiki/Continuous_integration>`_ pipeline sul `Freeport Jenkins server <https://jenkins.freeports.org>`_ , questo server effettua delle routine di controllo sul codice (specificate nel file ``Jenkinsfile`` localizzato in cima all'albero delle cartelle del repositorio). Nello specifico:

source: Lint the code
it: Fa il *lint* del codice (ne controlla la qualità)

source: Fail if a minimal linting vote is reached
it: Fallisce se non vengono raggiunti requisiti minimi di qualità del codice

source: Test the code and fail if some test is not passed
it: Esegue i test del codice e fallisce nel caso non vengano passati tutti

source: Fail if a minimal percentage of code is not tested
it: Fallisce se una percentuale minima del codice non è testata

source: Build the documentation
it: Compila la documentazione

source: Fail if a minimal percentage of the code is not documented
it: Fallisce se una percentuale minima del codice non è documentato

source: If the commit is tagged as `release version` (using `semantic versioning specification <https://semver.org/>`_) it publishes it to `PyPI <https://pypi.org/project/freeports-analysis/>`_
it: Se il commit è caratterizzato e classificato come `versione di rilascio` (seguendo la `specificazione semantic versioning <https://semver.org/>`_) lo pubblica su `PyPI <https://pypi.org/project/freeports-analysis/>`_

source: The difference between the two branches is that the state of the pipeline is only informative on the ``dev`` branch (it means that it only shows the failing) but the positive outcome is **imposed a requirement** for the PR on ``main`` branch to be approved and merged.
it: La differenza tra in due rami è che lo stato della pipeline è unicamente informativo sul ramo ``dev`` (significa che il fallimento di essa è solo notificato) ma l'esito positivo è invece un **requisito necessario** per l'approvazione di una PR sul ramo ``main`` e la sua integrazione nel repositorio.

source: In particular the development divide between:
it: In particolare lo sviluppo si divide tra:

source: development of tools for helping the contribution process
it: sviluppo degli strumenti per aiutare il processo di contribuzione

source: development of the code common for the different `pdf reports` (for example the source code related to the options and behaviour of the ``freeports`` command)
it: sviluppo del codice comune tra i diversi `report pdf` (per esempio il codice sorgente relativo alle opzioni e il comportamento del comando ``freeports``)

source: development of the code for parsing the different `pdf report formats`
it: sviluppo del codice per elaborare diversi `formati dei report pdf`

source: development of tests on the code
it: sviluppo dei test sul codice

source: writing of the documentation
it: scrittura della documentazione

source: internationalization of the code (translation of messages in output of the command)
it: internazionalizzazione del codice (traduzione dei messaggi in output al comando)

source: internationalization of the documentation (translation of the documentation)
it: internazionalizzazione della documentazione (traduzione della documentazione)

source: you can consult the specific guide related to the type of contribution that you want to do. When you feel comfortable with the concepts you can go forward with the workflow :doc:`examples provided <example>`; this page not only contains video expaining the possible contributions but also how to deploy them.
it: puoi consultare la guida specifica relativa al tipo di contribuzione che vorresti fare. Quando ti senti a tuo agio con i concetti trattati puoi andare avanti con il :doc:`workflow di esempio <example>` fornito; questa pagina non contiene solo video tutoria spiegando i modi possibili di contribuzione ma anche come integrarli con il repositorio di freeports.
