Repository: GVoreste/analysis_finance_reports
Catalog: docs/source/locales/*/LC_MESSAGES/contribute.po
Languages: it

source: How to contribute
it: Come contribuire

source: The general workflow to contribute is:
it: Il meccanismo generale per contribuire è:

source: *forking the repository*
it: *biforcare il repositorio*

source: making your edits to the code
it: applicazione delle tue modifiche al codice

source: *submitting a pull request*
it: *sottomissione di una richiesta di integrazione delle modifiche*

source: Before doing so you need to setup your local repository
it: Prima di cominciare è necessario configurare il tuo repositorio locale

source: Setting up the local repo
it: Configurazione del repo locale

source: First thing clone locally your *forked repository*
it: Prima cosa, clona localmente il tuo *fork del repositorio*

source: then enter your local copy and initialize the repository launching from within the root folder of your repository
it: poi accedi alla tua copia locale e inizializza il repositorio lanciando dalla cartella di base del tuo repositorio

source: this script does:
it: questo script:

source: install the `githooks <https://git-scm.com/docs/githooks>`_ of the project
it: installa i `githooks <https://git-scm.com/docs/githooks>`_ del progetto

source: create a python `virtual environment <https://docs.python.org/3/library/venv.html>`_
it: crea un `ambiente virtuale <https://docs.python.org/3/library/venv.html>`_ python

source: install the required packages for developing the project
it: installa i pacchetti necessari per lo sviluppo del progetto

source: Contribute
it: Contribuisci

source: Before making any contribution activate your developing virtual environment located in ``venv/freeports-dev``. If you want to create other virtual environment, please do that in the *gitignored* ``venv/`` directory. To activate the virtual environment launch:
it: Prima di fare qualunque contribuzione, attiva il tuo ambiente virtuale localizzato in ``venv/freeports-dev``. Se vuoi creare un altro ambiente virtuale, per favore fallo nella cartella ``venv/`` ignorata da git. Per attivare l'ambiente virtuale lancia:

source: in other to *deactivate* it, just launch the ``deactivate`` command. If you want to know more about how the project is structured, you can continue reading the :doc:`developer documentation <dev/index>`
it: per *disattivarlo*, lancia semplicemente il comando ``deactivate``. Se vuoi sapere di più su come è strutturato il progetto, puoi continuare la lettura della :doc:` documentatione per sviluppatori <dev/index>`

source: Guidelines
it: Linee guida

source: comment your code
it: commenta il tuo codice

source: add the `docstings <https://peps.python.org/pep-0257/>`_ in order to autogenerate the documentation
it: aggiungi le `docstings <https://peps.python.org/pep-0257/>`_ così da poter generare automaticamente la documentazione

source: `type hint <https://peps.python.org/pep-0484/>`_ your code
it: `tipizza <https://peps.python.org/pep-0484/>`_ il tuo codice

source: write `tests <https://docs.pytest.org/en/stable/>`_ for your code
it: scrivi `tests <https://docs.pytest.org/en/stable/>`_ per il tuo codice

source: add meaningful commit messages (add the issue id if it refears to one)
it: scrivi messaggi di commit con un significato (aggiungi l'issue id se si riferisce ad un issue di GitHub)

source: `lint <https://www.pylint.org/>`_ your code
it: esegui il `lint <https://www.pylint.org/>`_ del tuo codice

source: Contribution to the website
it: Contribuzione al sito web

source: It is possible to contribute to the `official website <https://www.freeports.org>`_ of the project from the specific `GitHub repository <https://github.com/GVoreste/analysis_finance_reports_website>`_.
it: E' possibile contribuire al `sito ufficiale <https://www.freeports.org>`_ del progetto dal `repositorio GitHub <https://github.com/GVoreste/analysis_finance_reports_website>`_ specifico.

source: Resources
it: Risorse

source: `How to Contribute to Open Source <https://opensource.guide/how-to-contribute/>`_
it: `Come contribuire all'Open Source <https://opensource.guide/how-to-contribute/>`_

source: `Using Pull Requests <https://help.github.com/articles/about-pull-requests/>`_
it: `Usare le Pull Requests <https://help.github.com/articles/about-pull-requests/>`_

source: `GitHub Help <https://help.github.com>`_
it: `Sezione aiuto di GitHub <https://help.github.com>`_
