Repository: GVoreste/analysis_finance_reports
Catalog: src/freeports_analysis/locales/*/LC_MESSAGES/messages.po
Languages: it

source: Analyze finance reports searching for investing in companies allegedly involved interantional law violations by third parties
it: Analizza report finanziari cercando investimenti in aziende presumibilmente coinvolte in violazioni del diritto internazionale

source: URL of the dir where to find the pdf
it: Indirizzo URL della risorsa pdf

source: Name of the file
it: Nome del file

source: Activate `BATCH MODE`, path of the batch file
it: Attiva `MODALITA' BATCH`, percorso del file batch

source: # parallel workers in `BATCH MODE`, if num <= 0, it set to # cpu avalaibles
it: # processi paralleli in `MODALITA' BATCH`, se num <=0 è fissato a # cpu disponibili

source: PDF format
it: Formato PDF

source: Don't save file locally
it: Non salvare i file localmente

source: Separate output files
it: Separa i file di output

source: Custom configuration file location
it: Percorso custom del file di configurazione

source: Output file cvs (default path: '{}')
it: File csv di output (percorso di default '{}')

source: Increase verbosity (default level: {})
it: Aumenta verbosità (livello di default: {})

source: Decrease verbosity (default level: {})
it: Diminuisci verbosità (livello di default: {})

source: Cannot increase and decrease verbosity!
it: Non puoi aumentare e diminuire la verbosità!

source: Searching `xdg`/`Windows` compliant conf file: '%s'
it: Cerco il file di configurazione in una posizione standard `xdg`/`Windows`: '%s'

source: Found local conf file: '%s'
it: Trovato file di configurazione locale: '%s'

source: Found `xdg`/`Windows` compliant conf file: '%s'
it: Trovato file di configurazione in un percorso standard `xdg`/`Windows`: '%s'

source: Found system wise conf file: '%s'
it: Trovata un file di configurazione di sistema: '%s'

source: Configuration not found in default location, `CONFIG_FILE` set to `None`
it: File di configurazione non trovato nei percorsi default, `CONFIG_FILE` e' fissato a `None`

source: '{}' is not castable to `True` {} nor `False` {}
it: '{}' non è convertibile ne a `True` {} che a `False` {}

source: Resulting config: %s
it: Configurazione risultante: %s

source: Verbosity must be between 0 and 5, resulting is {}
it: La verbosità deve essere tra 0 e 5, invece risulta uguale a {}

source: You have to specify at least one input option:
it: Devi specificare almeno una opzione in input:

source: the url or the resource, the pdf file path or both
it: l'url della risorsa, il file pdf o entrambi

source: Out path is not valid because directory '{}' doesn't exists
it: Il percorso di output non è valido perché la cartella '{}' non esiste

source: Batch '{}' has to be existent file
it: Il batch '{}' deve essere un file esistente

source: Out file in `BATCH MODE` should be directory or `.tar.gz` file
it: Il file in output in `MODALITA' BATCH` deve essere una cartella o un file `.tar.gz`

source: if `SEPARATE_OUT_FILES` not set to '{}'
it: se `SEPARATE_OUT_FILES` è vero, non fissato a '{}'

source: perc_net_assets must be between 0 and 1, not {}
it: perc_net_assets deve essere tra 0 e 1, non {}

source: page should be a positive number, not {}
it: la pagina deve essere un numero positivo, non {}

source: company should be between targets, not {}
it: la compagnia deve essere tra i targets, non {}

source: Acquisition cost
it: Costo di acquisizione

source: Type match
it: Tipo di corrispondenza

source: Subfund
it: Sottofondo

source: Company
it: Compagnia

source: Currency
it: Valuta

source: Market value
it: Valore di mercato

source: of net assets
it: del patrimonio netto

source: Quantity
it: Quantità

source: Additional infos
it: Informazioni aggiuntive

source: Interest rate of bond in not between 0 and 1, maybe should be normalized?
it: Il tasso di interesse non è tra 0 e 1, forse andrebbe normalizzato?

source: Maturity
it: Scadenza

source: Interest rate
it: Tasso di interesse

source: Module {} ({}) not found
it: Modulo {} ({}) non è stato trovato

source: File %s saved on disk [in %s]
it: File %s salvato sul disco [in %s]

source: Starting batch form page %i to %i
it: Inizio batch da pagina %i a %i

source: Extracting relevant blocks of pdf from page %i to %i...
it: Sto estraendo i blocchi del pdf rilevanti dalla pagina %i alla %i...

source: Filtering relevant blocks of text from page %i to %i...
it: Sto esrtaendo i blocchi di testo dalla pagina %i alla %i...

source: ERROR, SOMETHING WENT WRONG!!!!
it: ERRORE, QUALCOSA E' ANDATO STORTO!!!!

source: Remote URL %s/%s used [detected %s format]
it: Utilizzato URL remoto %s/%s [rilevato formato %s]

source: No format selected and url doesn't match know formats
it: Nessun formato è selezionato e l'indirizzo url non corrisponde a nessun formato conosciuto

source: Detected and selected formats don't match [det=%s sel=%s]
it: Formato rilevato e formato selezionato non corrispondono [det=%s sel=%s]

source: Using %s format
it: Uso il formato %s

source: Starting job with configuration %s
it: Inizio del task con configurazione %s

source: Starting decoding pdf to xml...
it: Inizio della decodifica da pdf a xml

source: End decoding pdf to xml!
it: Fine della decodifica da pdf a xml!

source: First 5 targets: %s
it: Primi 5 targets: %s

source: ({} type)
it: (tipo {})

source: Still filtering...
it: Sto ancora filtrando...

source: Found percentage symbol '%' but `norm` is False - forcing normalization
it: Ho trovato il simbolo della percentuale '%' ma `norm` è fissato a Falso - forzo la normalizzazione

source: Failed to convert percentage string '%s' to float
it: Ho fallito a convertire la percentuale come testo '%s' a numero a virgola mobile

source: Trying to cast to number but found '%s' - forcing cast
it: Sto trovando a convertire a numero, ma ho trovato '%s' - forzo la conversione

source: Number {} has a mantissa different form 0
it: Il numero {} ha una mantissa diversa da 0

source: Date string '{}' is not in a recognized format.
it: La data in formato testuale '{}' non è riconosciuta.

source: Expected bond or equity text blocks, found {}
it: Aspettati blocchi testuali di obbligazione o azione, trovato {}

source: Something wrong happened, text block is None...
it: Qualcosa è andato storto, il blocco di testo è vuoto...

source: Cast error in company %s
it: Errore di conversione per la compagnia %s

source: Skipping page
it: Pagina saltata

source: subfund block on top of page not found
it: blocco del sottofondo a inizio pagina non trovato

source: Line PDF - Font
it: Linea PDF - Font

source: All positions must be non-zero
it: Tutte le posizioni devono essere diverse da zero

source: All positions should be different
it: Tutte le posizioni devono essere diverse tra loro
