Repository: GVoreste/analysis_finance_reports
Catalog: docs/source/locales/*/LC_MESSAGES/usage/installation.po
Languages: it

source: Installation
it: Installazione

source: There are for now 2 installation method:
it: Sono supportati per ora 2 metodi di installazione:

source: using ``pip`` *(Recommended)*
it: usando ``pip`` *(Raccomandato)*

source: from source
it: da sorgente

source: Using ``pip``
it: Usando ``pip``

source: Install in a python virtual environment launching
it: Installa in un ambiente python virtuale lanciando

source: From source
it: Da codice sorgente

source: You need to have the python ``build`` package installed. You can install it in your virtual environment with ``pip install build``
it: Devi avere il pacchetto python ``build`` installato. Puoi installarlo nell'ambiente virtuale con ``pip install build``

source: Clone the repository:
it: Clona il repositorio:

source: `cd` into the created directory
it: esegui `cd` per entrare nella cartella appena creata

source: build the package
it: compila il pacchetto

source: install local package
it: installa localmente il pacchetto

source: enjoy
it: buon divertimento
